#+title: Notes about the course

Back-end development by [[https://www.coursera.org/professional-certificates/meta-back-end-developer][Meta, on Coursera]].

*** Format
#+begin_src python :session localhost :results output :eval no
a=1
b="abb"
print("{0} is different from {1}" .format(a, b))
#+end_src

#+RESULTS:
: 1 is different from abb
**** Args
#+begin_src python :session localhost :results output :eval no
def s(*args):
return sum(args)

print(s(3,4,5,6))
#+end_src

#+RESULTS:
: 18

#+begin_src python :session localhost :results output :eval no
def s(*args):
return sum(*args)

print(s([3,4,5,6]))
#+end_src

#+RESULTS:
: 18

***** Create file and populate it

#+begin_src python :session localhost :results output :eval no :tangle ./Exercises/Python-mod2/files.py
try:
with open('sample/newfile.txt', 'w') as file:
file.writelines(["Hello", "\nThere", "\nThird line!"])

with open('sample/newfile.txt', 'a') as file:
file.writelines(["\nHello", "\nThere", "\nThird line!"])
except FileNotFoundError as e:
print("Error: ", e)
#+end_src

#+RESULTS:
: Error:  [Errno 2] No such file or directory: 'sample/newfile.txt'
*** Functional programming
#+begin_src python :session localhost :results output :eval no
# Recursive function for Tower of Hanoi
def hanoi(disks, source, helper, destination):
print('P1 - disk: {}, source: {}, helper: {}, destination: {}'.format(disks, source, helper, destination))
# Base Condition
if (disks == 1):
print('Disk {} moves from tower {} to tower {}.'.format(disks, source, destination))
return

# Recursive calls in which function calls itself
hanoi(disks - 1, source, destination, helper)
print('P2 - disk: {}, source: {}, helper: {}, destination: {}'.format(disks, source, helper, destination))
print('Disk {} moves from tower {} to tower {}.'.format(disks, source, destination))
hanoi(disks - 1, helper, source, destination)
print('P3 - disk: {}, source: {}, helper: {}, destination: {}'.format(disks, source, helper, destination))

# Driver code
# disks = int(input('Number of disks to be displaced: '))
disks = 3
'''
Tower names passed as arguments:
Source: A
Helper: B
Destination: C
'''
# Actual function call
hanoi(disks, 'A', 'B', 'C')
#+end_src

#+RESULTS:
#+begin_example
P1 - disk: 3, source: A, helper: B, destination: C
P1 - disk: 2, source: A, helper: C, destination: B
P1 - disk: 1, source: A, helper: B, destination: C
Disk 1 moves from tower A to tower C.
P2 - disk: 2, source: A, helper: C, destination: B
Disk 2 moves from tower A to tower B.
P1 - disk: 1, source: C, helper: A, destination: B
Disk 1 moves from tower C to tower B.
P3 - disk: 2, source: A, helper: C, destination: B
P2 - disk: 3, source: A, helper: B, destination: C
Disk 3 moves from tower A to tower C.
P1 - disk: 2, source: B, helper: A, destination: C
P1 - disk: 1, source: B, helper: C, destination: A
Disk 1 moves from tower B to tower A.
P2 - disk: 2, source: B, helper: A, destination: C
Disk 2 moves from tower B to tower C.
P1 - disk: 1, source: A, helper: B, destination: C
Disk 1 moves from tower A to tower C.
P3 - disk: 2, source: B, helper: A, destination: C
P3 - disk: 3, source: A, helper: B, destination: C
#+end_example
*** Slice functions
#+begin_src python :session localhost :results output :eval no
# str[start:stop:step]
trial = "rbvcrsal"
new_trial = trial[::-1]
print(new_trial)
print("---", range(len(trial)), "---")
print(trial[len(trial):-(len(trial)+1):-1])
print(new_trial == trial[len(trial):-(len(trial)+1):-1])
for i in range(len(trial)):
print(trial[i::-1])
# print(trial[i:-(len(trial)+1):-1])
#+end_src

#+RESULTS:
#+begin_example
lasrcvbr
--- range(0, 8) ---
lasrcvbr
True
r
br
vbr
cvbr
rcvbr
srcvbr
asrcvbr
lasrcvbr
#+end_example
*** Recursive reversal
#+begin_src python :session localhost :results output :eval no
trial="abcdefg"

# Idea: concatenate string in the opposite order
print(trial)
print("trial[1:]: ", trial[1:], ", trial[0]: ", trial[0], sep='')
print("trial[2:]: ", trial[2:], ", trial[1]: ", trial[1], ", trial[0]: ", trial[0], sep='')
# trial[0] -> get first character in string
def first_character(str):
return str[0]

def string_opposite(str):
if len(str) == 0:
return "" # empty string -> always will concatenate the empty string in last call
else:
# get first character and concatenate (at the end),
# with the reversed string of the orginial string, less the first character.
return string_opposite(str[1:]) + first_character(str)

print(string_opposite(trial))
#+end_src

#+RESULTS:
: abcdefg
: trial[1:]: bcdefg, trial[0]: a
: trial[2:]: cdefg, trial[1]: b, trial[0]: a
: gfedcba
*** =map= and =filter=
#+begin_src python :session localhost :results output :eval no
l = ["abc", "cde", "efg", "fgh", "aaa"]
def has_a(str):
if any([c == "a" for c in str]):
return str
# map(has_a, l)
print("Map:")
print(list(map(has_a,l)))
# for x in map(has_a, l):
#     print(x)

print("Filter:")
print(list(filter(has_a,l)))
# for x in filter(has_a, l):
#     print(x)

print([x for x in l if has_a(x)])
#+end_src

#+RESULTS:
: Map:
: ['abc', None, None, None, 'aaa']
: Filter:
: ['abc', 'aaa']
: ['abc', 'aaa']

#+begin_src python :session localhost :results output :eval no
a = [[96], [69]]

print(''.join(list(map(str, a))))
print(type(''.join(list(map(str, a)))))
#+end_src
*** Assignment - list comprehension
#+begin_src python :session localhost :results output :eval no
# Input data: List of dictionaries
employee_list = [
{"id": 12345, "name": "John", "department": "Kitchen"},
{"id": 12456, "name": "Paul", "department": "House Floor"},
{"id": 12478, "name": "Sarah", "department": "Management"},
{"id": 12434, "name": "Lisa", "department": "Cold Storage"},
{"id": 12483, "name": "Ryan", "department": "Inventory Mgmt"},
{"id": 12419, "name": "Gill", "department": "Cashier"}
]

# Function to be passed to the map() function. Do not change this.
def mod(employee_list):
temp = employee_list['name'] + "_" + employee_list["department"]
return temp

def to_mod_list(employee_list):
""" Modifies the employee list of dictionaries into list of employee-department strings

[IMPLEMENT ME]
1. Use the map() method to apply mod() to all elements in employee_list

Args:
employee_list: list of employee objects

Returns:
list - A list of strings consisting of name + department.
"""
### WRITE SOLUTION CODE HERE
return list(map(mod, employee_list))
#raise NotImplementedError()

def generate_usernames(mod_list):
""" Generates a list of usernames

[IMPLEMENT ME]
1. Use list comprehension and the replace() function to replace space
    characters with underscores

List comprehension looks like:
list = [ function() for <item> in <list> ]

The format for the replace() function is:

test_str.replace(“a”, “z”) # replaces every “a” in test_str with “z”

Args:
mod_list: list of employee-department strings

Returns:
list - A list of usernames consisting of name + department delimited by underscores.
"""
return [str.replace(" ", "_") for str in mod_list]
### WRITE SOLUTION CODE HERE

#raise NotImplementedError()

def map_id_to_initial(employee_list):
""" Maps employee id to first initial

[IMPLEMENT ME]
1. Use dictionary comprehension to map each employee's id (value) to the first letter in their name (key)

Dictionary comprehension looks like:
dict = { key : value for <item> in <list> }

Args:
employee_list: list of employee objects

Returns:
dict - A dictionary mapping an employee's id (value) to their first initial (key).
"""
#return {value:key for (key,value) in employ.items() for employ in employee_list}
ids=[]
names=[]
for d in employee_list:
ids.append(d["id"])
names.append(str(d["name"])[0])
return {value:key for (key, value) in zip(ids, names)}

### WRITE SOLUTION CODE HERE

#raise NotImplementedError()

def main():
mod_emp_list = to_mod_list(employee_list)
print("Modified employee list: " + str(mod_emp_list) + "\n")

print(f"List of usernames: {generate_usernames(mod_emp_list)}\n")

print(f"Initials and ids: {map_id_to_initial(employee_list)}")

if __name__ == "__main__":
main()
#+end_src

#+RESULTS:
: Modified employee list: ['John_Kitchen', 'Paul_House Floor', 'Sarah_Management', 'Lisa_Cold Storage', 'Ryan_Inventory Mgmt', 'Gill_Cashier']
:
: List of usernames: ['John_Kitchen', 'Paul_House_Floor', 'Sarah_Management', 'Lisa_Cold_Storage', 'Ryan_Inventory_Mgmt', 'Gill_Cashier']
:
: Initials and ids: {'J': 12345, 'P': 12456, 'S': 12478, 'L': 12434, 'R': 12483, 'G': 12419}
**** Examples
#+begin_src python :session localhost :results output :eval no
class MyClass():
a = 5
print("Hello")

myc = MyClass()
print(MyClass.a)
print(myc.a)
#+end_src


#+begin_src python :session localhost :results output :eval no
class MyClass():
a = 5
def hello(self):
print("Hello, world!")

myc = MyClass()
print(MyClass.a)
print(myc.hello())
myc.hello()
#+end_src

#+RESULTS:
: 5
: Hello, world!
: None
: Hello, world!

#+begin_src python :session localhost :results output :eval no
class House:
'''
This is a stub for a class representing a house that can be used to create objects and evaluate different metrics that we may require in constructing it.
'''
num_rooms = 5
bathrooms = 2
def cost_evaluation(self):
print(self.num_rooms)
pass
# Functionality to calculate the costs from the area of the house

house = House()
print(house.num_rooms)
print(House.num_rooms)

house.num_rooms = 7
print(house.num_rooms)
print(House.num_rooms)

House.num_rooms = 10
house2 = House()
print(house2.num_rooms)
print(House.num_rooms)
#+end_src

#+RESULTS:
: 5
: 5
: 7
: 5
: 10
: 10
**** Scope resolution
- LEGB rule
- *Local*: inside funtion;
- Enclosed: inside enclosed or nested function;
- *Global*: upmost level, outside functions;
- Built-in: in the built-in modules;

#+begin_src python :session localhost :results both
globals() # built-in function
locals() # built-in function
#+end_src

#+RESULTS:
| __name__ | : | __main__ | __doc__ | : | hline | __package__ | : | hline | __loader__ | : | <class | _frozen_importlib.BuiltinImporter | > | __spec__ | : | hline | __annotations__ | : | nil | __builtins__ | : | <module | builtins | (built-in) | > | __PYTHON_EL_eval | : | <function | __PYTHON_EL_eval | at | 0x7f5bc81e5940> | __PYTHON_EL_eval_file | : | <function | __PYTHON_EL_eval_file | at | 0x7f5bc81e59d0> | __PYTHON_EL_native_completion_setup | : | <function | __PYTHON_EL_native_completion_setup | at | 0x7f5bc81e5a60> | ast | : | <module | ast | from | /opt/miniconda3/lib/python3.9/ast.py | > | __org_babel_python_tmpfile | : | <_io.TextIOWrapper | name= | /tmp/babel-QftOX3/python-HQCpev | mode= | w | encoding= | UTF-8 | > | __org_babel_python_ast | : | <ast.Module | object | at | 0x7f5bc8070fd0> | __org_babel_python_final | : | (...) | sys | : | <module | sys | (built-in) | > | loc | : | ( /opt/miniconda3/lib/python39.zip /opt/miniconda3/lib/python3.9 /opt/miniconda3/lib/python3.9/lib-dynload /home/buddhilw/.local/lib/python3.9/site-packages /opt/miniconda3/lib/python3.9/site-packages) | i | : | /opt/miniconda3/lib/python3.9/site-packages | calendar | : | <module | calendar | from | /opt/miniconda3/lib/python3.9/calendar.py | > | leapdays | : | 13 |
*** Final Test
#+begin_src python :session localhost :results output :eval no
for x in range(1, 4):
print(int((str((float(x))))))
#+end_src

#+RESULTS:

#+begin_src python :session localhost :results output :eval no
str = 'Pomodoro'
for l in str:
if l == 'o':
str = str.split()
print(str, end=", ")
#+end_src

#+RESULTS:


#+begin_src python :session localhost :results output :eval no
def d():
color = "green"
def e():
nonlocal color
color = "yellow"
e()
print("Color: " + color)
color = "red"
color = "blue"
d()
#+end_src

#+RESULTS:
: Color: yellow


#+begin_src python :session localhost :results output :eval no
num = 9
class Car:
num = 5
bathrooms = 2

def cost_evaluation(num):
num = 10
return num

class Bike():
num = 11

cost_evaluation(num)
car = Car()
bike = Bike()
car.num = 7
Car.num = 2
print(num)
#+end_src

#+RESULTS:
: 9

#+begin_src python :session localhost :results output :eval no
Class P():
pass
Class C(P):
pass
p=P()
c=C()
# print(issubclass(p,P))
# print(issubclass(C,c))
print(issubclass(C,P))
# print(issubclass(C,P))
#+end_src

#+RESULTS:

#+begin_src python :session localhost :results output :eval no
class A:
def a(self):
return "Function inside A"

class B:
def a(self):
return "Function inside B"

class C:
pass

class D(C, A, B):
pass

d = D()
print(d.a())
#+end_src
**** Example, setting repo
Make fine =git101=,
#+begin_src shell :results both :noeval :exports both
mkdir git101
#+end_src

#+RESULTS:

=cd= into =git101=, and initiate a new git repository,
#+begin_src shell :results both :noeval :exports both
cd git101
git init
#+end_src

#+RESULTS:
: Initialized empty Git repository in /home/buddhilw/gdrive/PP/Meta/git101/.git/

If we check for a remote, the output will be blank. We need to setup the remote repository.
#+begin_src shell
cd git101
git remote
#+end_src

#+RESULTS:

We can see the current directory this file is in has a remote,
#+begin_src shell
git remote -v
#+end_src

#+RESULTS:
| origin | https://github.com/BuddhiLW/Meta-backend-course.git (fetch) |
| origin | https://github.com/BuddhiLW/Meta-backend-course.git (push)  |

We can set the new =git101= to the same repository,
#+begin_src shell
cd git101
git remote add origin https://github.com/BuddhiLW/Meta-backend-course.git
#+end_src

#+RESULTS:

Then, we check and see that =git101= is now attached to the remote.
#+begin_src shell
cd git101
git remote -v
#+end_src

#+RESULTS:
| origin | https://github.com/BuddhiLW/Meta-backend-course.git (fetch) |
| origin | https://github.com/BuddhiLW/Meta-backend-course.git (push)  |

#+begin_src shell :results output :exports both :noeval
cd git101
git pull
#+end_src

#+RESULTS:

#+begin_example
There is no tracking information for the current branch.
Please specify which branch you want to merge with.
See git-pull(1) for details.

git pull <remote> <branch>

If you wish to set tracking information for this branch you can do so with:

git branch --set-upstream-to=origin/<branch> master
#+end_example

#+begin_src shell
cd git101
ls
#+end_src

#+RESULTS:

#+begin_src shell
cd git101
git checkout main
#+end_src

#+RESULTS:
: branch 'main' set up to track 'origin/main'.

#+begin_src shell
cd git101
ls
#+end_src

#+RESULTS:
| Exercises      |
| README-org.org |
| README.md      |
| img            |
*** =.git= file
Where =git= keeps track of every change in the /repository/.
#+begin_src shell :output both
cd .git
cat HEAD
#+end_src

#+RESULTS:
:ref: refs/heads/main

#+begin_src shell :output both
cd .git
cat refs/heads/main
#+end_src

#+RESULTS:
: 4474b383b7d9870b8a50c155eaedd262c18e0182

The hash =4474b383b7d9870b8a50c155eaedd262c18e0182=, in our case, points to the current commit. If we were to switch branches, this =id= would be different.

**** How to start sql client on terminal
Given that you installed MariaDB and configured it for =buddhilw= with a password. Also, you have permission to =buddhilw= to access the =mydb= database (Follow https://wiki.archlinux.org/title/MariaDB#Add_user). Then, you can:

#+begin_src shell
mysql -u buddhilw -p
#+end_src

#+RESULTS:
#+begin_example
Enter password:
Welcome to the MariaDB monitor.  Commands end with ; or \g.
Your MariaDB connection id is 50
Server version: 10.8.4-MariaDB Arch Linux

Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MariaDB [(none)]>
#+end_example


OBS.: if you enconter the error, after MariaDB install: =error 2002 (hy000): can't connect to local server through socket '/run/mysqld/mysqld.sock' (2) archlinux=. Then, follow the instructions in:
https://archlinux.org/news/mariadb-replaces-mysql-in-repositories/

**** Example1
#+begin_src sql
CREATE DATABASE mydb;
USE mydb;

CREATE TABLE w2ex1 (Device_ID int, Qnt int, Tot_Price decimal);
#+end_src

#+begin_src sql
show tables;
#+end_src

#+RESULTS:
: +----------------+

: +----------------+
: | w2ex1          |
: +----------------+
: 1 row in set (0,001 sec)

#+begin_src sql
show columns from w2ex1;
#+end_src

#+RESULTS:
: +-----------+---------------+------+-----+---------+-------+
: | Field     | Type          | Null | Key | Default | Extra |
: +-----------+---------------+------+-----+---------+-------+
: | Device_ID | int(11)       | YES  |     | NULL    |       |
: | Qnt       | int(11)       | YES  |     | NULL    |       |
: | Tot_Price | decimal(10,0) | YES  |     | NULL    |       |
: +-----------+---------------+------+-----+---------+-------+
: 3 rows in set (0,002 sec)

**** Example2
Using =CHAR= and =VARCHAR=.

We start by lauching =mysql=,
#+begin_src shell
mysql -u buddhilw -p
#+end_src

Then, we create a new table in the =mydb= database.
#+begin_src sql
USE mydb;
CREATE TABLE w2e2 (Username CHAR(9), Full_Name VARCHAR(50), Email VARCHAR(30));
#+end_src

This way, we can hold the following example data:
|-----------+--------------+------------------------|
| Username  | Full_Name    | Email                  |
|-----------+--------------+------------------------|
| Custom001 | John Johnson | J.Johnson@email.com    |
| Custom002 | Carl Schmidt | Carl.Schmidt@email.com |
| Custom003 | Yara Suliman | Yara.Suliman@email.com |
|-----------+--------------+------------------------|

#+begin_src sql
show columns from w2e2;
#+end_src

#+RESULTS:
#+begin_example
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| Username  | char(9)     | YES  |     | NULL    |       |
| Full_Name | varchar(50) | YES  |     | NULL    |       |
| Email     | varchar(30) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+
3 rows in set (0,002 sec)
#+end_example
**** Exercises
#+begin_src shell
mysql -u buddhilw -p
#+end_src

#+begin_src sql
CREATE TABLE w2e3 (Customer_ID INT NOT NULL, Street VARCHAR(50), Postcode VARCHAR(50) DEFAULT "HA3 0AE", Town VARCHAR(30) DEFAULT "Harrow");
#+end_src

#+begin_src sql
SHOW COLUMNS FROM w2e3;
#+end_src

#+RESULTS:
#+begin_example
+-------------+-------------+------+-----+---------+-------+
| Field       | Type        | Null | Key | Default | Extra |
+-------------+-------------+------+-----+---------+-------+
| Customer_ID | int(11)     | NO   |     | NULL    |       |
| Street      | varchar(50) | YES  |     | NULL    |       |
| Postcode    | varchar(50) | YES  |     | HA97DE  |       |
| Town        | varchar(30) | YES  |     | Harrow  |       |
+-------------+-------------+------+-----+---------+-------+
#+end_example
